app/controllers/songs_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-05-01 10:22:16.792199"], ["updated_at", "2018-05-01 10:22:16.792199"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2018-05-01 10:22:16.803030"], ["updated_at", "2018-05-01 10:22:16.803030"]]
---
  def upload
    CSV.foreach(params[:file].path, headers: true) do |file|
      Song.create(title: file[0], artist_name: file[1])